In [1]:
import pandas as pd               
import IPython           # for displaying the data structures

In [2]:
# Series

s = pd.Series([5,7,8,2,3],index=['a','b','c','d','e'])         # 1D labelled array capable of holding any data types
display(s)

a    5
b    7
c    8
d    2
e    3
dtype: int64

In [3]:
# Dataframe
data = {'Country' : ['india','france','england'],
       'Capital' : ['New dehli','Paris','landon'],
       'Population' : [134212015,111908046,204565789]}
df = pd.DataFrame(data,columns=['Country','Capital','Population'])
display(df)

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789

In [4]:
# input and ouput

# read and write csv
df.to_csv('country.csv',index=None)             # Creates a csv file with values of df and no index
df1 = pd.read_csv('country.csv')                # reads values from country.csv and saves it to df1
display(df1)                                    # display df1 

# read and write from excel
df.to_excel('country.xlsx',sheet_name='country')            # writes values of df to counrty.xlsx
df2 = pd.read_excel('country.xlsx',sheetname='country')     # reads values from country.xlsx and saves it to df2
display(df2)                                                # display df2

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789

In [5]:
# selection

# getting elements
display(s)                                        # display array 
print(s['b'],' = value of b\n')                   # get one element

display(df)                                       # display dataframe
print(df[1:],' = subset of df\n')                 # get subset of dataframe

# by position
print(df.iloc[0,0],' = element at 0th row and 0th coloumn\n')                          # select single value by row and coloumn
print(df.iat[2,0],' = element at 2nd row and 0th coloumn\n')                           # select element at sepcifiedlocation

# by label
print(df.loc[0,'Country'],' = element at 0th row and under the coloumn of country\n')  # select single value by row and coloumn labels
print(df.at[1,'Country'],' = element at 1st row and under the coloumn of country\n')   # select single value by row and coloumn labels

# by label 
print(df.ix[2],' = select row 2\n')                                                    # select single row of subset of rows
print(df.ix[:,'Capital'],' = select capital coloumn\n')                                # select single coloumn of subset of coloumn 
print(df.ix[1,'Capital'],' = select 1 st row element in capital\n')                    # select rpw and coloumn

# boolean indexing 
print(df[df['Population']>12000000],' = population > 120000000\n')                     # filter to adjust dataframe
print(s,'\n')                                                                          # display s
print(s[~(s>3)],' = elements graeter than 3\n')                                        # series where value is not > 3    
print(s[(s < 1) | (s > 4)],'= <1 or >4\n')                                             # s value where s is < 1 or > 4 

# setting
s['a'] = 10                                                                            # set index value a to 10 
display(s)

a    5
b    7
c    8
d    2
e    3
dtype: int64

7  = value of b

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789

   Country Capital  Population
1   france   Paris   111908046
2  england  landon   204565789  = subset of df

india  = element at 0th row and 0th coloumn

england  = element at 2nd row and 0th coloumn

india  = element at 0th row and under the coloumn of country

france  = element at 1st row and under the coloumn of country

Country         england
Capital          landon
Population    204565789
Name: 2, dtype: object  = select row 2

0    New dehli
1        Paris
2       landon
Name: Capital, dtype: object  = select capital coloumn

Paris  = select 1 st row element in capital

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789  = population > 120000000

a    5
b    7
c    8
d    2
e    3
dtype: int64

d    2
e    3
dtype: int64  = elements graeter than 3

a    5
b    7
c    8
dtype: int64 = <1 or >4

c:\users\zero\appdata\local\programs\python\python35\lib\site-packages\ipykernel_launcher.py:19: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix

a    10
b     7
c     8
d     2
e     3
dtype: int64

In [6]:
# Droping
display(s)                                       # display s
s1 = s.drop(['a','c'])                           # drop values from rows (axis = 0) default
print(s1,' = s1(dropped values)')                # display dropped values

display(df)                                      # display df
df.drop('Country',axis=1)                        # drop values from coloumns (axis = 1)

a    10
b     7
c     8
d     2
e     3
dtype: int64

b    7
d    2
e    3
dtype: int64  = s1(dropped values)

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789

     Capital  Population
0  New dehli   134212015
1      Paris   111908046
2     landon   204565789

In [7]:
# sorting and ranking
display(df)                                                            # display df
print(df.sort_index(),' = sorted by labels\n')                         # sort by labels along an axis
print(df.sort_values(by='Country'),' = sorted by counrty\n')           # sort by values along an axis
print(df.rank(),' = ranks\n')                                          # assign ranks to entries

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789  = sorted by labels

   Country    Capital  Population
2  england     landon   204565789
1   france      Paris   111908046
0    india  New dehli   134212015  = sorted by counrty

   Country  Capital  Population
0      3.0      1.0         2.0
1      2.0      2.0         1.0
2      1.0      3.0         3.0  = ranks

In [8]:
# Data frame and Series information

# basic information
display(df)                                               # display df 
print(df.shape,' = shape of df\n')                        # display shape of df (rows,coloumns) 
print(df.index,' = index\n')                              # describe index
print(df.columns,' = coloumns\n')                         # describe dataframe coloumns
print(df.info(),' = info\n')                              # returns info on df
print(df.count(),' = count\n')                            # returns number of non-NA values

# Summary
print(df.sum(),' = sum\n')                                # returns sum of values
print(df.cumsum(),' = cummulative sum\n')                 # returns cummulative sum of df
print(df.min(),' = min value\n')                          # returns the minimum value of df
print(df.max(),' = max value\n')                          # returns max value
print(df.describe(),' = description of df\n')             # returns summary statistics
print(df.mean(),' = mean\n')                              # returns the mean of df
print(df.median(),' = median\n')                          # returns median of values in df

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789

(3, 3)  = shape of df

RangeIndex(start=0, stop=3, step=1)  = index

Index(['Country', 'Capital', 'Population'], dtype='object')  = coloumns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
Country       3 non-null object
Capital       3 non-null object
Population    3 non-null int64
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes
None  = info

Country       3
Capital       3
Population    3
dtype: int64  = count

Country         indiafranceengland
Capital       New dehliParislandon
Population               450685850
dtype: object  = sum

              Country               Capital Population
0               india             New dehli  134212015
1         indiafrance        New dehliParis  246120061
2  indiafranceengland  New dehliParislandon  450685850  = cummulative sum

Country         england
Capital       New dehli
Population    111908046
dtype: object  = min value

Country           india
Capital          landon
Population    204565789
dtype: object  = max value

         Population
count  3.000000e+00
mean   1.502286e+08
std    4.836076e+07
min    1.119080e+08
25%    1.230600e+08
50%    1.342120e+08
75%    1.693889e+08
max    2.045658e+08  = description of df

Population    1.502286e+08
dtype: float64  = mean

Population    134212015.0
dtype: float64  = median

In [12]:
# applying functions

display(df)                                       # display dataframe df
f = lambda x: x*2                                 # define function
print(df.apply(f),' = applied function f\n')      # apply the function f
print(df.applymap(f),' = apply map\n')            # apply function f element wise

   Country    Capital  Population
0    india  New dehli   134212015
1   france      Paris   111908046
2  england     landon   204565789

          Country             Capital  Population
0      indiaindia  New dehliNew dehli   268424030
1    francefrance          ParisParis   223816092
2  englandengland        landonlandon   409131578  = applied function f

          Country             Capital  Population
0      indiaindia  New dehliNew dehli   268424030
1    francefrance          ParisParis   223816092
2  englandengland        landonlandon   409131578  = apply map

In [18]:
# Data allignment

# internal data alignment
s2 = pd.Series([3,9,5],index=['a','c','d'])                        # create a new series
print(s2,' = s2\n')                                                # display s2
print(s,' = s\n')                                                  # display s  
s3 = s + s2                                                        # NA values are introduced in the indices that dont overlap 
print(s3,' = s3(s + s2)\n')                                        # display s3


# arithemetic operations with fill method
print(s.add(s3,fill_value=0),' = add\n')                                        # display s3 with values after adding with s, any NaN will be considered as 0
print(s.sub(s3,fill_value=2),' = sub\n')                                        # display s3 with values after substracting with s, any NaN will be considered as 0
print(s.mul(s3,fill_value=4),' = mul\n')                                        # display s3 with values after multiplying with s, any NaN will be considered as 0
print(s.div(s3,fill_value=3),' = div\n')                                        # display s3 with values after dividing with s, any NaN will be considered as 0

a    3
c    9
d    5
dtype: int64  = s2

a    10
b     7
c     8
d     2
e     3
dtype: int64  = s

a    13.0
b     NaN
c    17.0
d     7.0
e     NaN
dtype: float64  = s3(s + s2)

a    23.0
b     7.0
c    25.0
d     9.0
e     3.0
dtype: float64  = add

a   -3.0
b    5.0
c   -9.0
d   -5.0
e    1.0
dtype: float64  = sub

a    130.0
b     28.0
c    136.0
d     14.0
e     12.0
dtype: float64  = mul

a    0.769231
b    2.333333
c    0.470588
d    0.285714
e    1.000000
dtype: float64  = div

In [28]:
# reshaping data

data = {'date' : ['2017-03-01','2017-02-01','2017-04-01','2017-01-01','2017-06-01','2017-05-01'],
       'type' : ['a','b','a','c','d','b'],
       'value' : [11.3,12.6,96.2,14.3,12.5,45.3]}                                   # set new values for dataframe
df3 = pd.DataFrame(data,columns=['date','type','value'])                            # create new dataframe
print(df3,' = df3\n')                                                               # display dataframe

df4 = df3.pivot(index='date',columns='type',values='value')                         # spread rows into coloumns
print(df4,' = df4\n')                                                               # display the pivoted df  
 
df5 = pd.pivot_table(df3,values='value',index='date',columns='type')                # spread rows into coloumns
print(df5,' =df5\n')                                                                # display df5

         date type  value
0  2017-03-01    a   11.3
1  2017-02-01    b   12.6
2  2017-04-01    a   96.2
3  2017-01-01    c   14.3
4  2017-06-01    d   12.5
5  2017-05-01    b   45.3  = df3

type           a     b     c     d
date
2017-01-01   NaN   NaN  14.3   NaN
2017-02-01   NaN  12.6   NaN   NaN
2017-03-01  11.3   NaN   NaN   NaN
2017-04-01  96.2   NaN   NaN   NaN
2017-05-01   NaN  45.3   NaN   NaN
2017-06-01   NaN   NaN   NaN  12.5  = df4

type           a     b     c     d
date
2017-01-01   NaN   NaN  14.3   NaN
2017-02-01   NaN  12.6   NaN   NaN
2017-03-01  11.3   NaN   NaN   NaN
2017-04-01  96.2   NaN   NaN   NaN
2017-05-01   NaN  45.3   NaN   NaN
2017-06-01   NaN   NaN   NaN  12.5  =df5

In [34]:
# Stack & unstack
print(df4,' = df4\n')                                               # display df4
stacked = df4.stack()                                               # pivot a level of coloumn labels
print(stacked,' = stacked\n')                                       # display stacked
print(stacked.unstack(),' = unstacked')                             # pivote a level of index labels

type           a     b     c     d
date
2017-01-01   NaN   NaN  14.3   NaN
2017-02-01   NaN  12.6   NaN   NaN
2017-03-01  11.3   NaN   NaN   NaN
2017-04-01  96.2   NaN   NaN   NaN
2017-05-01   NaN  45.3   NaN   NaN
2017-06-01   NaN   NaN   NaN  12.5  = df4

date        type
2017-01-01  c       14.3
2017-02-01  b       12.6
2017-03-01  a       11.3
2017-04-01  a       96.2
2017-05-01  b       45.3
2017-06-01  d       12.5
dtype: float64  = stacked

type           a     b     c     d
date
2017-01-01   NaN   NaN  14.3   NaN
2017-02-01   NaN  12.6   NaN   NaN
2017-03-01  11.3   NaN   NaN   NaN
2017-04-01  96.2   NaN   NaN   NaN
2017-05-01   NaN  45.3   NaN   NaN
2017-06-01   NaN   NaN   NaN  12.5  = unstacked

In [47]:
# melt

display('df3',df3)                                                                             # display df3
df6 = pd.melt(df3,id_vars=['date'],value_vars=['type','value'],var_name='observations')        # gather coloumns into rows 
display('df6',df6)                                                                             # display df6

'df3'

         date type  value
0  2017-03-01    a   11.3
1  2017-02-01    b   12.6
2  2017-04-01    a   96.2
3  2017-01-01    c   14.3
4  2017-06-01    d   12.5
5  2017-05-01    b   45.3

'df6'

          date observations value
0   2017-03-01         type     a
1   2017-02-01         type     b
2   2017-04-01         type     a
3   2017-01-01         type     c
4   2017-06-01         type     d
5   2017-05-01         type     b
6   2017-03-01        value  11.3
7   2017-02-01        value  12.6
8   2017-04-01        value  96.2
9   2017-01-01        value  14.3
10  2017-06-01        value  12.5
11  2017-05-01        value  45.3